Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxCan_reg.h
/** \brief A94, High Priority Message Status 2 */
#define CAN1_N2_HPMS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_HPMS*)0xF0218A94u)
/** Alias (User Manual Name) for CAN1_N2_HPMS.
* To use register names with standard convension, please use CAN1_N2_HPMS.
*/
#define CAN1_HPMS2 (CAN1_N2_HPMS)

/** \brief A98, New Data 1 2 */
#define CAN1_N2_NDAT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NDAT1*)0xF0218A98u)
/** Alias (User Manual Name) for CAN1_N2_NDAT1.
* To use register names with standard convension, please use CAN1_N2_NDAT1.
*/
#define CAN1_NDAT12 (CAN1_N2_NDAT1)

/** \brief A9C, New Data 2 2 */
#define CAN1_N2_NDAT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NDAT2*)0xF0218A9Cu)
/** Alias (User Manual Name) for CAN1_N2_NDAT2.
* To use register names with standard convension, please use CAN1_N2_NDAT2.
*/
#define CAN1_NDAT22 (CAN1_N2_NDAT2)

/** \brief AA0, Rx FIFO 0 Configuration 2 */
#define CAN1_N2_RX_F0C /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0C*)0xF0218AA0u)
/** Alias (User Manual Name) for CAN1_N2_RX_F0C.
* To use register names with standard convension, please use CAN1_N2_RX_F0C.
*/
#define CAN1_RXF0C2 (CAN1_N2_RX_F0C)

/** \brief AA4, Rx FIFO 0 Status 2 */
#define CAN1_N2_RX_F0S /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0S*)0xF0218AA4u)
/** Alias (User Manual Name) for CAN1_N2_RX_F0S.
* To use register names with standard convension, please use CAN1_N2_RX_F0S.
*/
#define CAN1_RXF0S2 (CAN1_N2_RX_F0S)

/** \brief AA8, Rx FIFO 0 Acknowledge 2 */
#define CAN1_N2_RX_F0A /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0A*)0xF0218AA8u)
/** Alias (User Manual Name) for CAN1_N2_RX_F0A.
* To use register names with standard convension, please use CAN1_N2_RX_F0A.
*/
#define CAN1_RXF0A2 (CAN1_N2_RX_F0A)

/** \brief AAC, Rx Buffer Configuration 2 */
#define CAN1_N2_RX_BC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_BC*)0xF0218AACu)
/** Alias (User Manual Name) for CAN1_N2_RX_BC.
* To use register names with standard convension, please use CAN1_N2_RX_BC.
*/
#define CAN1_RXBC2 (CAN1_N2_RX_BC)

/** \brief AB0, Rx FIFO 1 Configuration 2 */
#define CAN1_N2_RX_F1C /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1C*)0xF0218AB0u)
/** Alias (User Manual Name) for CAN1_N2_RX_F1C.
* To use register names with standard convension, please use CAN1_N2_RX_F1C.
*/
#define CAN1_RXF1C2 (CAN1_N2_RX_F1C)

/** \brief AB4, Rx FIFO 1 Status 2 */
#define CAN1_N2_RX_F1S /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1S*)0xF0218AB4u)
/** Alias (User Manual Name) for CAN1_N2_RX_F1S.
* To use register names with standard convension, please use CAN1_N2_RX_F1S.
*/
#define CAN1_RXF1S2 (CAN1_N2_RX_F1S)

/** \brief AB8, Rx FIFO 1 Acknowledge 2 */
#define CAN1_N2_RX_F1A /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1A*)0xF0218AB8u)
/** Alias (User Manual Name) for CAN1_N2_RX_F1A.
* To use register names with standard convension, please use CAN1_N2_RX_F1A.
*/
#define CAN1_RXF1A2 (CAN1_N2_RX_F1A)

/** \brief ABC, Rx Buffer/FIFO Element Size Configuration 2 */
#define CAN1_N2_RX_ESC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_ESC*)0xF0218ABCu)
/** Alias (User Manual Name) for CAN1_N2_RX_ESC.
* To use register names with standard convension, please use CAN1_N2_RX_ESC.
*/
#define CAN1_RXESC2 (CAN1_N2_RX_ESC)

/** \brief AC0, Tx Buffer Configuration 2 */
#define CAN1_N2_TX_BC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BC*)0xF0218AC0u)
/** Alias (User Manual Name) for CAN1_N2_TX_BC.
* To use register names with standard convension, please use CAN1_N2_TX_BC.
*/
#define CAN1_TXBC2 (CAN1_N2_TX_BC)

/** \brief AC4, Tx FIFO/Queue Status 2 */
#define CAN1_N2_TX_FQS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_FQS*)0xF0218AC4u)
/** Alias (User Manual Name) for CAN1_N2_TX_FQS.
* To use register names with standard convension, please use CAN1_N2_TX_FQS.
*/
#define CAN1_TXFQS2 (CAN1_N2_TX_FQS)

/** \brief AC8, Tx Buffer Element Size Configuration 2 */
#define CAN1_N2_TX_ESC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_ESC*)0xF0218AC8u)
/** Alias (User Manual Name) for CAN1_N2_TX_ESC.
* To use register names with standard convension, please use CAN1_N2_TX_ESC.
*/
#define CAN1_TXESC2 (CAN1_N2_TX_ESC)

/** \brief ACC, Tx Buffer Request Pending 2 */
#define CAN1_N2_TX_BRP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BRP*)0xF0218ACCu)
/** Alias (User Manual Name) for CAN1_N2_TX_BRP.
* To use register names with standard convension, please use CAN1_N2_TX_BRP.
*/
#define CAN1_TXBRP2 (CAN1_N2_TX_BRP)

/** \brief AD0, Tx Buffer Add Request 2 */
#define CAN1_N2_TX_BAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BAR*)0xF0218AD0u)
/** Alias (User Manual Name) for CAN1_N2_TX_BAR.
* To use register names with standard convension, please use CAN1_N2_TX_BAR.
*/
#define CAN1_TXBAR2 (CAN1_N2_TX_BAR)

/** \brief AD4, Tx Buffer Cancellation Request 2 */
#define CAN1_N2_TX_BCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCR*)0xF0218AD4u)
/** Alias (User Manual Name) for CAN1_N2_TX_BCR.
* To use register names with standard convension, please use CAN1_N2_TX_BCR.
*/
#define CAN1_TXBCR2 (CAN1_N2_TX_BCR)

/** \brief AD8, Tx Buffer Transmission Occurred 2 */
#define CAN1_N2_TX_BTO /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BTO*)0xF0218AD8u)
/** Alias (User Manual Name) for CAN1_N2_TX_BTO.
* To use register names with standard convension, please use CAN1_N2_TX_BTO.
*/
#define CAN1_TXBTO2 (CAN1_N2_TX_BTO)

/** \brief ADC, Tx Buffer Cancellation Finished 2 */
#define CAN1_N2_TX_BCF /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCF*)0xF0218ADCu)
/** Alias (User Manual Name) for CAN1_N2_TX_BCF.
* To use register names with standard convension, please use CAN1_N2_TX_BCF.
*/
#define CAN1_TXBCF2 (CAN1_N2_TX_BCF)

/** \brief AE0, Tx Buffer Transmission Interrupt Enable 2 */
#define CAN1_N2_TX_BTIE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BTIE*)0xF0218AE0u)
/** Alias (User Manual Name) for CAN1_N2_TX_BTIE.
* To use register names with standard convension, please use CAN1_N2_TX_BTIE.
*/
#define CAN1_TXBTIE2 (CAN1_N2_TX_BTIE)

/** \brief AE4, Tx Buffer Cancellation Finished Interrupt Enable 2 */
#define CAN1_N2_TX_BCIE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCIE*)0xF0218AE4u)
/** Alias (User Manual Name) for CAN1_N2_TX_BCIE.
* To use register names with standard convension, please use CAN1_N2_TX_BCIE.
*/
#define CAN1_TXBCIE2 (CAN1_N2_TX_BCIE)

